# Assignment

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
series=pd.Series([4, 8, 15, 16, 23,42])
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
lst=[1,2,3,4,5,6,7,8,9,10]
series=pd.Series(lst)
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
    
Name                                 Age                            Gender
Alice                                 25                            Female
Bob                                   30                             Male
Claire                                27                            Female

In [4]:
dataframe=pd.DataFrame({"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})

In [5]:
dataframe

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame: 
    
It is two dimensional tabular structure which can contains elements of different data types.Therefore, it is heterogenous in nature.
Data Frame is Size-mutable i.e. Elements can be dropped or added in an existing DataFrame.

Series: 
    
It is one dimensional labeled array which contains elements only of same data type.Therefore, it is homogenous in nature.
series is Size-immutable i.e. Once created, the size of a Series object cannot be changed.

In [6]:
import pandas as pd
df=pd.DataFrame({"Name":["John","Ram","Harry"],"Age":[45,20,70]})
df

    Name  Age
0   John   45
1    Ram   20
2  Harry   70

In [7]:
series=pd.Series([10,11,12])
series

0    10
1    11
2    12
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

iloc(),loc(),slicing,drop(),rename()

In [8]:
df

    Name  Age
0   John   45
1    Ram   20
2  Harry   70

In [9]:
df.iloc[0:2]

   Name  Age
0  John   45
1   Ram   20

In [10]:
df.loc[0:2]

    Name  Age
0   John   45
1    Ram   20
2  Harry   70

In [11]:
df.drop(1,axis=0)

    Name  Age
0   John   45
2  Harry   70

In [12]:
df.rename(columns={"Name":"First Name","Age":"How old are they"})

  First Name  How old are they
0       John                45
1        Ram                20
2      Harry                70

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series, DataFrame and panel are value-mutable 

DataFrame and panel are size-mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [13]:
s1=pd.Series([1,2,3])                                   ## column 1 for df
s2=pd.Series([10,11,12])                                ## column 2 for df
s3=pd.Series([100,101,102])                             ## column 3 for df
df=pd.DataFrame([s1,s2,s3])
df

     0    1    2
0    1    2    3
1   10   11   12
2  100  101  102

----